In [129]:
# Dependencies and setup
import pandas as pd
import datetime

## Melbourne Weather - Data Cleaning

### Daily Total Rainfall

In [96]:
# Read the raw data files and view data
melbourne_rainfall_path = "raw_data/melbourne_weather/IDCJAC0009_086338_1800_Data.csv"
melb_rainfall_data = pd.read_csv(melbourne_rainfall_path)
melb_rainfall_data.head()

,Product code,Bureau of Meteorology station number,Year,Month,Day,Rainfall amount (millimetres),Period over which rainfall was measured (days),Quality
0,IDCJAC0009,86338,2013,1,1,NaN,NaN,NaN
1,IDCJAC0009,86338,2013,1,2,NaN,NaN,NaN
2,IDCJAC0009,86338,2013,1,3,NaN,NaN,NaN
3,IDCJAC0009,86338,2013,1,4,NaN,NaN,NaN
4,IDCJAC0009,86338,2013,1,5,NaN,NaN,NaN

In [97]:
# Check data characteristics (ensure that numeric columns are integer - they are so no change required)
melb_rainfall_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3183 entries, 0 to 3182
Data columns (total 8 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Product code                                    3183 non-null   object
 1   Bureau of Meteorology station number            3183 non-null   int64
 2   Year                                            3183 non-null   int64
 3   Month                                           3183 non-null   int64
 4   Day                                             3183 non-null   int64
 5   Rainfall amount (millimetres)                   3026 non-null   float64
 6   Period over which rainfall was measured (days)  3025 non-null   float64
 7   Quality                                         3026 non-null   object
dtypes: float64(2), int64(4), object(2)
memory usage: 199.1+ KB

In [98]:
# Delete extraneous columns ("Product code","Bureau of Meteorology station number","Period over which rainfall was measured (days)","Quality")
del melb_rainfall_data["Product code"]
del melb_rainfall_data["Bureau of Meteorology station number"]
del melb_rainfall_data["Period over which rainfall was measured (days)"]
del melb_rainfall_data["Quality"]

# Remove rows containing NaN
melb_rainfall_data_clean=melb_rainfall_data.dropna()


melb_rainfall_data_clean.head()

     Year  Month  Day  Rainfall amount (millimetres)
152  2013      6    2                            5.0
153  2013      6    3                            0.2
154  2013      6    4                            0.2
155  2013      6    5                            0.0
156  2013      6    6                            0.0

In [99]:
# Check for any incomplete rows
melb_rainfall_data_clean.count()

Year                             3026
Month                            3026
Day                              3026
Rainfall amount (millimetres)    3026
dtype: int64

In [100]:
# Check for missing days
melb_rainfall_data_clean["Year"].value_counts()

# Need years 2014-2019 for analysis. Out of these years, 2014 is complete, 2015 is one day short, 2016 is complete (leap year=366d), 
# 2017 is complete, 2018 is two days short, 2019 is complete. Note:to check for NaN values when this data is merged with 
# another dataset.

2016    366
2020    366
2014    365
2017    365
2019    365
2015    364
2018    363
2021    259
2013    213
Name: Year, dtype: int64

In [101]:
# Check rainfall data values reasonable (no outliers).
melb_rainfall_data_clean["Rainfall amount (millimetres)"].describe()

# a max of 54.6mm rainfall is a reasonable number, no negative rainfall numbers (minimum = 0 mm).

count    3026.000000
mean        1.508328
std         4.281743
min         0.000000
25%         0.000000
50%         0.000000
75%         0.800000
max        54.600000
Name: Rainfall amount (millimetres), dtype: float64

### Max. Daily Temperature

In [102]:
# Read the raw data files and view data
melbourne_temperature_path = "raw_data/melbourne_weather/IDCJAC0010_086338_1800_Data.csv"
melb_temperature_data = pd.read_csv(melbourne_temperature_path)
melb_temperature_data.head()

,Product code,Bureau of Meteorology station number,Year,Month,Day,Maximum temperature (Degree C),Days of accumulation of maximum temperature,Quality
0,IDCJAC0010,86338,2013,1,1,NaN,NaN,NaN
1,IDCJAC0010,86338,2013,1,2,NaN,NaN,NaN
2,IDCJAC0010,86338,2013,1,3,NaN,NaN,NaN
3,IDCJAC0010,86338,2013,1,4,NaN,NaN,NaN
4,IDCJAC0010,86338,2013,1,5,NaN,NaN,NaN

In [103]:
# Check data characteristics (ensure that numeric columns are integer - all ok)
melb_temperature_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3182 entries, 0 to 3181
Data columns (total 8 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   Product code                                 3182 non-null   object
 1   Bureau of Meteorology station number         3182 non-null   int64
 2   Year                                         3182 non-null   int64
 3   Month                                        3182 non-null   int64
 4   Day                                          3182 non-null   int64
 5   Maximum temperature (Degree C)               3030 non-null   float64
 6   Days of accumulation of maximum temperature  3030 non-null   float64
 7   Quality                                      3029 non-null   object
dtypes: float64(2), int64(4), object(2)
memory usage: 199.0+ KB

In [104]:
# Check if days of accumulation of maximum temperature
melb_temperature_data["Days of accumulation of maximum temperature"].value_counts()

# No accumulated temperature values in data set - no data correction required and so column can be removed in next step.

1.0    3030
Name: Days of accumulation of maximum temperature, dtype: int64

In [105]:
# Delete extraneous columns ("Product code","Bureau of Meteorology station number","Quality")
del melb_temperature_data["Product code"]
del melb_temperature_data["Bureau of Meteorology station number"]
del melb_temperature_data["Days of accumulation of maximum temperature"]
del melb_temperature_data["Quality"]

# Remove rows containing NaN
melb_temperature_data_clean=melb_temperature_data.dropna()

melb_temperature_data_clean.head()

     Year  Month  Day  Maximum temperature (Degree C)
151  2013      6    1                            15.8
152  2013      6    2                            15.7
153  2013      6    3                            14.8
154  2013      6    4                            15.0
155  2013      6    5                            14.6

In [106]:
# Check for missing days
melb_temperature_data_clean["Year"].value_counts()

# Need years 2014-2019 for analysis. Out of these years, no missing days (2016 is a leap year with 366 days). 
# So when merging datasets, use this one as a base.

2016    366
2020    366
2014    365
2018    365
2015    365
2017    365
2019    365
2021    259
2013    214
Name: Year, dtype: int64

In [107]:
# Check maximum temperature data values reasonable (no outliers).
melb_temperature_data_clean["Maximum temperature (Degree C)"].describe()

# a mean of 20 deg C, a max of 43.5 deg C and min of 6.1 deg C is reasonable for Melbourne weather.

count    3030.000000
mean       20.299769
std         6.117367
min         9.000000
25%        15.600000
50%        19.000000
75%        23.700000
max        43.500000
Name: Maximum temperature (Degree C), dtype: float64

### Merge the two Melbourne weather dataframes

In [143]:
# Combine the two Melbourne datasets (rainfall and temperature) into a single Melbourne Weather dataset
melbourne_combined_df = pd.merge(melb_rainfall_data_clean, melb_temperature_data_clean,how="right", on=["Year","Month","Day"])

# Display the data table for preview
melbourne_combined_df.head()

,Year,Month,Day,Rainfall amount (millimetres),Maximum temperature (Degree C)
0,2013,6,1,NaN,15.8
1,2013,6,2,5.0,15.7
2,2013,6,3,0.2,14.8
3,2013,6,4,0.2,15.0
4,2013,6,5,0.0,14.6

In [144]:
# Find those missing rainfall days identified earlier (expect 1 in 2015, 2 in 2018 and 1 in 2019 out of the years of interest of 2014-2019)
melbourne_combined_df.loc[melbourne_combined_df["Rainfall amount (millimetres)"].isna(),:]

,Year,Month,Day,Rainfall amount (millimetres),Maximum temperature (Degree C)
0,2013,6,1,NaN,15.8
740,2015,6,11,NaN,14.0
1956,2018,10,9,NaN,17.9
1957,2018,10,10,NaN,16.5
2959,2021,7,9,NaN,12.0

In [145]:
# Remove rows containing NaN values in Rainfall column.
melbourne_combined_df=melbourne_combined_df.dropna()

In [146]:
# Confirm no more missing values
melbourne_combined_df.count()

Year                              3025
Month                             3025
Day                               3025
Rainfall amount (millimetres)     3025
Maximum temperature (Degree C)    3025
dtype: int64

In [150]:
# Concatenate the Year, Month and Day column into a Date column (will be required for future merging with traffic acident DataFrame)
melbourne_combined_df["dateInt"]=melbourne_combined_df["Year"].astype(str) + melbourne_combined_df["Month"].astype(str).str.zfill(2)+ melbourne_combined_df["Day"].astype(str).str.zfill(2)
melbourne_combined_df["Date"] = pd.to_datetime(melbourne_combined_df["dateInt"], format="%Y%m%d")
melbourne_combined_df["Date"] = melbourne_combined_df["Date"].dt.strftime("%Y/%m/%d")

# Remove no longer required columns
del melbourne_combined_df["dateInt"]
del melbourne_combined_df["Year"]
del melbourne_combined_df["Month"]
del melbourne_combined_df["Day"]

# Rearrange columns to desired order
melbourne_combined_df = melbourne_combined_df[["Date", "Rainfall amount (millimetres)", "Maximum temperature (Degree C)"]]

melbourne_combined_df.head()

         Date  Rainfall amount (millimetres)  Maximum temperature (Degree C)
1  2013/06/02                            5.0                            15.7
2  2013/06/03                            0.2                            14.8
3  2013/06/04                            0.2                            15.0
4  2013/06/05                            0.0                            14.6
5  2013/06/06                            0.0                            17.3

In [151]:
# Reset index and send cleaned Melbourne Weather data to CSV in cleaned_data folder
melbourne_combined_df.reset_index(drop=True)
melbourne_combined_df.head()

# Store Melbourne Weather data in CSV file
melbourne_combined_df.to_csv("cleaned_data/melbourne_weather.csv",encoding="utf-8",index = False)

## Hume Weather - Data Cleaning

### Daily Total Rainfall

In [113]:
# Read the raw data files and view data
hume_rainfall_path = "raw_data/hume_weather/IDCJAC0009_086282_1800_Data.csv"
hume_rainfall_data = pd.read_csv(hume_rainfall_path)
hume_rainfall_data.head()

,Product code,Bureau of Meteorology station number,Year,Month,Day,Rainfall amount (millimetres),Period over which rainfall was measured (days),Quality
0,IDCJAC0009,86282,1970,1,1,NaN,NaN,NaN
1,IDCJAC0009,86282,1970,1,2,NaN,NaN,NaN
2,IDCJAC0009,86282,1970,1,3,NaN,NaN,NaN
3,IDCJAC0009,86282,1970,1,4,NaN,NaN,NaN
4,IDCJAC0009,86282,1970,1,5,NaN,NaN,NaN

In [114]:
# Check data characteristics (ensure that numeric columns are integer - all ok)
hume_rainfall_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18889 entries, 0 to 18888
Data columns (total 8 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Product code                                    18889 non-null  object
 1   Bureau of Meteorology station number            18889 non-null  int64
 2   Year                                            18889 non-null  int64
 3   Month                                           18889 non-null  int64
 4   Day                                             18889 non-null  int64
 5   Rainfall amount (millimetres)                   18708 non-null  float64
 6   Period over which rainfall was measured (days)  8347 non-null   float64
 7   Quality                                         18708 non-null  object
dtypes: float64(2), int64(4), object(2)
memory usage: 1.2+ MB

In [115]:
# Check if there are days of accumulation of measured rainfall
hume_rainfall_data["Period over which rainfall was measured (days)"].value_counts()

# There are none, so no action required and column can be removed in next step.

1.0    8347
Name: Period over which rainfall was measured (days), dtype: int64

In [116]:
# Delete extraneous columns ("Product code","Bureau of Meteorology station number","Period over which rainfall was measured (days)","Quality")
del hume_rainfall_data["Product code"]
del hume_rainfall_data["Bureau of Meteorology station number"]
del hume_rainfall_data["Period over which rainfall was measured (days)"]
del hume_rainfall_data["Quality"]

# Remove rows containing NaN
hume_rainfall_data_clean=hume_rainfall_data.dropna()

hume_rainfall_data_clean.head()

     Year  Month  Day  Rainfall amount (millimetres)
181  1970      7    1                            0.3
182  1970      7    2                            3.0
183  1970      7    3                            0.0
184  1970      7    4                            0.0
185  1970      7    5                            3.6

In [117]:
# Check for any incomplete rows
hume_rainfall_data_clean.count()

Year                             18708
Month                            18708
Day                              18708
Rainfall amount (millimetres)    18708
dtype: int64

In [118]:
# Check for missing days
hume_rainfall_data_clean["Year"].value_counts()

# Need years 2014-2019 for analysis. Out of these years, 2014 is complete, 2015 is complete, 2016 is complete (leap year=266 days), 
# 2017 is complete, 2018 is complete, 2019 is complete.

1984    366
2012    366
1976    366
2000    366
2020    366
2004    366
2008    366
1972    366
1980    366
1996    366
1988    366
1992    366
2016    366
2010    365
1977    365
1999    365
1993    365
2009    365
1978    365
1994    365
1981    365
1997    365
1995    365
2011    365
1983    365
2014    365
1998    365
1982    365
2013    365
1979    365
1991    365
2007    365
1975    365
1985    365
2001    365
2017    365
1986    365
2002    365
2018    365
1971    365
1987    365
2003    365
2019    365
1973    365
1989    365
2005    365
1974    365
1990    365
2006    365
2015    365
2021    261
1970    184
Name: Year, dtype: int64

In [119]:
# Check rainfall data values reasonable (no outliers).
hume_rainfall_data_clean["Rainfall amount (millimetres)"].describe()

# a max of 138.8mm rainfall is a reasonable number, no negative rainfall numbers (minimum = 0 mm).

count    18708.000000
mean         1.467805
std          4.663583
min          0.000000
25%          0.000000
50%          0.000000
75%          0.800000
max        138.800000
Name: Rainfall amount (millimetres), dtype: float64

### Max. Daily Temperature

In [120]:
# Read the raw data files and view data
hume_temperature_path = "raw_data/hume_weather/IDCJAC0010_086282_1800_Data.csv"
hume_temperature_data = pd.read_csv(hume_temperature_path)
hume_temperature_data.head()

,Product code,Bureau of Meteorology station number,Year,Month,Day,Maximum temperature (Degree C),Days of accumulation of maximum temperature,Quality
0,IDCJAC0010,86282,1970,1,1,NaN,NaN,NaN
1,IDCJAC0010,86282,1970,1,2,NaN,NaN,NaN
2,IDCJAC0010,86282,1970,1,3,NaN,NaN,NaN
3,IDCJAC0010,86282,1970,1,4,NaN,NaN,NaN
4,IDCJAC0010,86282,1970,1,5,NaN,NaN,NaN

In [121]:
# Check data characteristics (ensure that numeric columns are integer - all ok)
hume_temperature_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18888 entries, 0 to 18887
Data columns (total 8 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   Product code                                 18888 non-null  object
 1   Bureau of Meteorology station number         18888 non-null  int64
 2   Year                                         18888 non-null  int64
 3   Month                                        18888 non-null  int64
 4   Day                                          18888 non-null  int64
 5   Maximum temperature (Degree C)               18706 non-null  float64
 6   Days of accumulation of maximum temperature  18705 non-null  float64
 7   Quality                                      18705 non-null  object
dtypes: float64(2), int64(4), object(2)
memory usage: 1.2+ MB

In [122]:
# Check if any days of accumulation of maximum temperature
hume_temperature_data["Days of accumulation of maximum temperature"].value_counts()

# No accumulated temperature values in data set - no data correction required and column can be removed.

1.0    18705
Name: Days of accumulation of maximum temperature, dtype: int64

In [123]:
# Delete extraneous columns ("Product code","Bureau of Meteorology station number","Quality")
del hume_temperature_data["Product code"]
del hume_temperature_data["Bureau of Meteorology station number"]
del hume_temperature_data["Days of accumulation of maximum temperature"]
del hume_temperature_data["Quality"]

# Remove rows containing NaN
hume_temperature_data_clean=hume_temperature_data.dropna()

hume_temperature_data_clean.head()

     Year  Month  Day  Maximum temperature (Degree C)
181  1970      7    1                            14.1
182  1970      7    2                            12.4
183  1970      7    3                            11.3
184  1970      7    4                            12.3
185  1970      7    5                            14.8

In [124]:
# Check for missing days
hume_temperature_data_clean["Year"].value_counts()

# Need years 2014-2019 for analysis. Out of these years, no missing days (2016 is a leap year with 366 days). 
# So when merging datasets, can use this one as base

1984    366
2012    366
2008    366
2000    366
2020    366
2004    366
1988    366
1992    366
1980    366
1996    366
1976    366
2016    366
1981    365
1997    365
1999    365
1977    365
1993    365
2009    365
1978    365
1994    365
2010    365
1979    365
1995    365
1983    365
2014    365
1998    365
1982    365
2013    365
2011    365
1991    365
2007    365
1975    365
1985    365
2001    365
2017    365
1986    365
2002    365
2018    365
1971    365
1987    365
2003    365
2019    365
1972    365
1973    365
1989    365
2005    365
1974    365
1990    365
2006    365
2015    365
2021    260
1970    184
Name: Year, dtype: int64

In [125]:
# Check maximum temperature data values reasonable (no outliers).
hume_temperature_data_clean["Maximum temperature (Degree C)"].describe()

# a mean of 19.9 deg C, a max of 46.8 deg C and min of 5.7 deg C are all possible for Hume weather. 
# Note: 46.8 deg C is a little high but this weather station is located at Melbourne airport in the Hume area so minimal 
# vegetation to keep temperatures cooler.

count    18706.000000
mean        19.856784
std          6.466474
min          5.700000
25%         14.800000
50%         18.600000
75%         23.600000
max         46.800000
Name: Maximum temperature (Degree C), dtype: float64

### Merge the two Hume weather dataframes

In [152]:
# Combine the two Hume datasets (rainfall and temperature) into a single Hume Weather dataset
hume_combined_df = pd.merge(hume_rainfall_data_clean, hume_temperature_data_clean,how="right", on=["Year","Month","Day"])

# Display the data table for preview
hume_combined_df.head()

,Year,Month,Day,Rainfall amount (millimetres),Maximum temperature (Degree C)
0,1970,7,1,0.3,14.1
1,1970,7,2,3.0,12.4
2,1970,7,3,0.0,11.3
3,1970,7,4,0.0,12.3
4,1970,7,5,3.6,14.8

In [153]:
# Check for any missing values
hume_combined_df.count()

Year                              18706
Month                             18706
Day                               18706
Rainfall amount (millimetres)     18706
Maximum temperature (Degree C)    18706
dtype: int64

In [154]:
# Concatenate the Year, Month and Day column into a Date column (will be required for future merging with traffic acident DataFrame)
hume_combined_df["dateInt"]=hume_combined_df["Year"].astype(str) + hume_combined_df["Month"].astype(str).str.zfill(2)+ hume_combined_df["Day"].astype(str).str.zfill(2)
hume_combined_df["Date"] = pd.to_datetime(hume_combined_df["dateInt"], format="%Y%m%d")
hume_combined_df["Date"] = hume_combined_df["Date"].dt.strftime("%Y/%m/%d")

# Remove no longer required columns
del hume_combined_df["dateInt"]
del hume_combined_df["Year"]
del hume_combined_df["Month"]
del hume_combined_df["Day"]

# Rearrange columns to desired order
hume_combined_df = hume_combined_df[["Date", "Rainfall amount (millimetres)", "Maximum temperature (Degree C)"]]

hume_combined_df.head()

         Date  Rainfall amount (millimetres)  Maximum temperature (Degree C)
0  1970/07/01                            0.3                            14.1
1  1970/07/02                            3.0                            12.4
2  1970/07/03                            0.0                            11.3
3  1970/07/04                            0.0                            12.3
4  1970/07/05                            3.6                            14.8

In [155]:
# Reset index and send clean Hume Weather data to CSV in cleaned_data folder
hume_combined_df.reset_index(drop=True)
hume_combined_df.head()

# Store Melbourne Weather data in CSV file
hume_combined_df.to_csv("cleaned_data/hume_weather.csv",encoding="utf-8",index = False)